In [1]:
import pandas as pd

data = {
    "name": ["Alice", "Bob", "Charlie", "Dana", "Eve"],
    "age": [24, 30, 29, 35, 22],
    "city": ["Seattle", "Tacoma", "Bremerton", "Seattle", "Tacoma"],
    "score": [88, 92, 95, 70, 85],
}

df = pd.DataFrame(data)
df

      name  age       city  score
0    Alice   24    Seattle     88
1      Bob   30     Tacoma     92
2  Charlie   29  Bremerton     95
3     Dana   35    Seattle     70
4      Eve   22     Tacoma     85

In [2]:
df.head()      # first 5 rows
df.info()      # column types + missing data
df.describe()  # numerical summary

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    5 non-null      object
 1   age     5 non-null      int64
 2   city    5 non-null      object
 3   score   5 non-null      int64
dtypes: int64(2), object(2)
memory usage: 292.0+ bytes

             age      score
count   5.000000   5.000000
mean   28.000000  86.000000
std     5.147815   9.721111
min    22.000000  70.000000
25%    24.000000  85.000000
50%    29.000000  88.000000
75%    30.000000  92.000000
max    35.000000  95.000000

In [3]:
df["name"]               # a Series
df[["name", "city"]]     # a DataFrame

      name       city
0    Alice    Seattle
1      Bob     Tacoma
2  Charlie  Bremerton
3     Dana    Seattle
4      Eve     Tacoma

In [4]:
df["name"]

0      Alice
1        Bob
2    Charlie
3       Dana
4        Eve
Name: name, dtype: object

In [5]:
df[["name", "city"]]

      name       city
0    Alice    Seattle
1      Bob     Tacoma
2  Charlie  Bremerton
3     Dana    Seattle
4      Eve     Tacoma

In [6]:
df.head()

      name  age       city  score
0    Alice   24    Seattle     88
1      Bob   30     Tacoma     92
2  Charlie   29  Bremerton     95
3     Dana   35    Seattle     70
4      Eve   22     Tacoma     85

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    5 non-null      object
 1   age     5 non-null      int64
 2   city    5 non-null      object
 3   score   5 non-null      int64
dtypes: int64(2), object(2)
memory usage: 292.0+ bytes

In [8]:
df[df["age"] > 25]            # ages over 25
df[df["city"] == "Seattle"]   # Seattle people

    name  age     city  score
0  Alice   24  Seattle     88
3   Dana   35  Seattle     70

In [9]:
df[df["age"] > 25]

      name  age       city  score
1      Bob   30     Tacoma     92
2  Charlie   29  Bremerton     95
3     Dana   35    Seattle     70